{"origin_pdf_path": "downloads/order_flow_1.pdf", "text_in_pdf": "Order \row and price formation\nFabrizio Lillo\nUniversity of Bologna and Scuola Normale Superiore,\nItaly\nMay 4, 2021\nAbstract\nI present an overview of some recent advancements on the empirical analysis and theoretical\nmodeling of the process of price formation in \fnancial markets as the result of the arrival\nof orders in a limit order book exchange. After discussing critically the possible modeling\napproaches and the observed stylized facts of order \row, I consider in detail market impact\nand transaction cost of trades executed incrementally over an extended period of time, by\ncomparing model predictions and recent extensive empirical results. I also discuss how the\nsimultaneous presence of many algorithmic trading executions a\u000bects the quality and cost of\ntrading.\n1 Introduction\nUnderstanding the price formation process in markets is of paramount importance both from an\nacademic and from a practical perspective. Markets can be seen as a collective evaluation system\nwhere the spatial' (i.e. across\nmarket venues or assets) local imbalance between supply and demand, thus acting as counterparts\nwhen liquidity is needed.\nOrder submission and trading constitute the way aggregation of information is obtained. The\nprocess through which this information is impounded into price is highly complex and might depend\non the speci\fc structure of the investigated market. Prices emerge as the consequence of the arrival\nof orders, which in turn are a\u000bected, among other things, by the recent dynamics of prices. Despite\nthe fact this feedback process is of paramount importance, the complexity of the process is only\npartial understood and many di\u000berent models are able to provide only a partial description of it.\nThe two main components of the price formation process are order \row and market impact. The\nformer refers to the dynamical process describing the arrival of buy and sell orders to the market. As\n1arXiv:2105.00521v1  [q-fin.TR]  2 May 2021\n\ndetailed below, this is in general a complicated process whose modelization is challenging because of\nthe high dimensionality and the presence of strong temporal correlations. Market impact is, broadly\nspeaking, the correlation between an incoming order and the subsequent price change. Since in\neach trade there is a buyer and a seller, it is not a priori obvious whether a given trade should move\non average the price up or down. Considering the role of information on prices, one can advance\nfew alternative explanations on the origin of market impact (for a more detailed discussion on this\npoint, see (Bouchaud et al., 2009)):\n•Trades convey a signal about private information. The arrival of new private infor-\nmation causes trades, which cause other agents to update their valuations, which changes\nprices.\n•Agents successfully forecast short-term price movements and trade accordingly.\nThus there might be market impact even if these agents have absolutely no e\u000bect on prices.\nIn the words of Hasbrouck the price' is something in between the best ask and the best bid. However, from the above\ndescription it is clear that at a certain time there is not a unique price in the market.\nBroadly speaking three modeling approaches have been pursued: (i) econometric models, \ftting\n3\n\nfor example large dimensional linear models on market data (queues, prices, order arrivals); (ii)\nstatistical models of the LOB, where orders arrive in the market as a random point process and\nthe resulting properties of the price is studied; (iii) computational agent based models, where a\nset of heterogeneous agents trade in a realistic environment, such as a LOB. I will mostly focus\non the \frst two approaches, despite the fact the third approach often provide important insights,\nespecially for testing alternative policy measures.\n3 Modeling approaches\nModeling order \row and price formation is a challenging task because of the complexity of the\nsystem and the large number of variables potentially involved. The modeler has di\u000berent choices\nto make, which in part depend on the available data and methods, but more often depend on the\nobjectives of the model.\nThe \frst choice is whether to work in continuous or in discrete time. The \frst option is the most\ncomplete, i.e. it does not discard any information of the process of price formation. Inter-event\ntimes can, in fact, provide relevant information on the event is going to occur. For example, the\nprice change triggered by a trade can depend on the time elapsed from the last trade. The modeling\nin discrete time disregards this information but allows to use all the machinery of discrete time\nseries analysis (ARMA, VAR, etc). Discrete time modeling can be deployed either by advancing\nthe clock by one unit any time a speci\fc event occurs, for example a trade or an order arrival,\nor by considering a \fnite interval of physical time, say 1 second, and by considering aggregated\nquantities (e.g. average or end-of-period LOB, total order \row, one second price return, etc).\nLet us consider \frst the continuous time approach and let Kthe number of available limit\nprices1. Denoting with pi\ntandqi\nt, (i= 1;:::;K ) the price and the number of shares on the i\u0000th\nlimit price at time t, the LOB dynamics is described by the continuous-time process Lt= (pi\nt;qi\nt:i=\n1;:::;K ). The order \row is described by the multivariate marked point process whose components\nare the intensity of limit orders ( \u0015i\nt), cancellations ( \u0017i\nt), and buy and sell market orders ( \u0016b\ntand\u0016s\nt).\nThe marks correspond to the volumes of the order, but for expositional simplicity we will assume\nthat all the orders have unitary volume. In general the rates are not constant in time but can\ndepend on the past history of the order \row, on the state of the order book ( Lfs<tg), and possibly\non other covariates. Let us call Otthe multivariate point process generated by the intensities\n(\u0015i\nt;\u0017i\nt;\u0016b\nt;\u0016s\nt:i= 1;:::;K ) and fully describing the order \row.\nIt is important to stress that the state of the LOB at a given time is completely determined\nby the past order \row, plus some initial condition. In other words, once we choose an observable\npriceptas reference (for example the midprice, the microprice, the ask), there exists a deterministic\nfunctionFsuch that\n\u0001pt\u0011pt\u0000pt\u0000\u001c=F(Lt\u0000\u001c;Os2(t\u0000\u001c;t)) (1)\n1Following (Cont et al., 2010), we consider Klarge enough that it is unlikely that in the considered period orders\nare placed outside the grid.\n4\n\nThus, from a purely econometric point of view, one could simply model the point process process\nOt. This type of models is often analytically tractable and, for this reason, it has been explored in\nthe past twenty years in several papers. The Zero Intelligence (or Santa Fe) model of (Daniels et al.,\n2003) and the model in (Cont et al., 2010), for example, consider independent Poisson processes for\nthe di\u000berent components of Ot. In order to include memory of the past order \row, (Abergel and\nJedidi, 2015) considers instead a multivariate Hawkes processes able to describe auto- and lagged\ncross-correlation between the di\u000berent components of the order \row.\nThe observable reference price in the LOB might not the fully re\rect the economic conditions\nof the \frm. For this reason, many models postulate the existence of an unobservable e\u000ecient\nprice, which typically follows a semimartingale dynamics. Market data (e.g. trade or mid price)\nare a noisy version of the e\u000ecient price and a lot of econometric e\u000bort is devoted to remove the\nmicrostructure noise either to \flter it or to estimate from ultra high frequency data some of its\nstatistical properties (for example the volatility) useful in applications such as option pricing or\nrisk management.\nAlthough order \row determines uniquely (observable) price changes, it is possible that a better\nmodel (in terms, for example, of explained variance) is obtained by considering the order \row\nintensities as dependent on LOB state Ltor of a function of it, such as the reference price pt. The\nreason is that, in general, the relation between intensities and past order \row is strongly non-linear\nand high dimensional. On the contrary, simpler and easier to estimate parametric models can be\nchosen by identifying the drivers that supposedly in\ruence real traders decision to submit a speci\fc\ntype of order2. For example, real traders likely decide when and where to place an order taking\ninto account the LOB state and the price. Thus one could use a model, which instead of modeling\nautonomously the order \row, makes the intensities dependent on the state of the LOB or of part\nof it (Huang et al., 2015).\nChoosing to build models using functions of the order \row could be also useful when deciding\nto restrict the dimensionality of the problem and restricting it to a subpart of the order \row (and\nof LOB). The reasons for this choice are manyfold: either for data availability (especially in the old\ntimes), for purely statistical reasons (dimensionality reduction and improved estimation), because\none believes that some parts of the order \row (e.g. trades) might be more informative on price\ndynamics, or because we are interested in modeling a part of the order \row and its e\u000bect on price\n(for example our order \row in a real trading problem). In these cases the reduced model giving\nthe price as a function of the (sub)order \row becomes stochastic and the randomness describes the\ne\u000bect of the unmodeled part of order \row. Following this line, one can take two approaches:\n1) Treat the order \row as exogenous to the price. In this case, the model connects the considered\npart of the order \row to the price, but neglects the reverse e\u000bect, i.e. how price dynamics can\na\u000bect order \row. Classical market microstructure models following this approach are the Roll\nmodel (and its generalization) and the Madhavan-Richardson-Roomans (Madhavan et al., 1997)\n2A recent alternative approach is to use modeling approach suited for high-dimensional non linear models, such\nas Deep Neural Networks. Even in these cases however it might be better to use LOB state rather than past order\n\row to forecast the LOB state at a future time. For example, Deep Learning has been used to forecast short term\nprice movement from LOB state and recent order \row (see, for example, (Sirignano, 2019)).\n5\n\nmodel. More recently, the Transient Impact Model (TIM, see (Bouchaud et al., 2004, 2009)) and\nits generalizations with multiple propagators have been proposed to describe the relation between\norder \row and price. In a nutshell, the general TIM can be written in discrete time (see below for\nthe continuous time version) as\npt=X\ns<tG\u0019s(t\u0000s)f(vs) +\u0018t+p\u00001 (2)\nwherevsis the signed volume of the order at time s,f(x) = sgn(x)h(jxj) withh(:) a concave\nfunction3, as observed empirically (Lillo et al., 2003), \u0019sindicates the type of event at time s(e.g.\nmarket order, limit order at a given price, etc), G\u0019s(t\u0000s) is a function, termed kernel orpropagator ,\nquantifying the lagged e\u000bect of the event \u0019sat timeson the price at time t, and\u0018tis a noise term\ndescribing the e\u000bect on price of all the orders which are not considered in the model. If the functions\nG\u0019sare not constant, Eq. (2) describes the transient nature of impact of event \u0019s, i.e. the fact that\nthe e\u000bect of an order on price is not permanent, but declines with time. Many empirical analyses\nshow thatG\u0019sare slowly decaying functions, typically well \ftted asymptotically by a power law\nfunction. The transient nature of impact can be related to the very persistent autocorrelations of\norder \row (see next section) and to the di\u000busivity and e\u000eciency of prices (see (Bouchaud et al.,\n2009) for an extensive discussion). While the original TIM was considering only one type of events,\nnamely market orders, subsequent works have included also limit orders and cancellations, while\nothers have discriminated more \fnely between orders changing and not changing the price, since\nthe (lagged) e\u000bect on price is shown to be di\u000berent in these cases (Eisler et al., 2012; Taranto et al.,\n2018).\nThe TIM describes trades that impact prices, but with a time dependent, decaying impact\nfunctionG(t). One can interpret the same model slightly di\u000berently. Considering the model with\none propagator associated with trades and taking f(vt) = sgn(vt)\u0011\u000ft, one can rewrite the model\nas\n\u0001pt=G(1)(\u000ft\u0000^\u000ft) +~\u0018t; (3)\n^\u000ft=\u0000X\ns>0G(s+ 1)\u0000G(s)\nG(1)\u000ft\u0000s (4)\nwith ~\u0018t= \u0001\u0018t. The quantity ^ \u000ftcan be seen as the (linear) predictor of trade sign given the past\nhistory of the signs and the model tells us that the deviation of the realized sign \u000ftfrom an expected\nlevel ^\u000ftimpacts the price linearly and permanently. If ^ \u000ftis the best possible predictor of \u000ft, then\nthe above equation leads by construction to an exact martingale for the price process. This model\nhas been termed History Dependent Impact Model (HDIM) (Lillo and Farmer, 2004; Bouchaud\net al., 2009; Taranto et al., 2018) and in the simple setting above is mathematically equivalent to\nthe TIM when the best predictor is linear in the past order signs. (Taranto et al., 2018) shows that\n3To avoid dealing with volume \ructuations, strongly dependent on LOB state, often it is chosen f(x) = sgn(x).\nsgn(x) denotes the sign function.\n6\n\nas soon as one attempts to generalize the model to multiple event types, TIM and HDIM become\nno longer equivalent. In fact, the HDIM with di\u000berent events can be rewritten as\n\u0001pt=G\u0019t(1)\"\n\u000ft+X\ns<t\u0014\u0019s;\u0019t(t\u0000s)\nG\u0019t(1)\u000fs+~\u0018t (5)\nwhere\u0014\u0019s;\u0019t(t\u0000s) is an in\ruence kernel that depends on both the past event type \u0019sand the\ncurrent event \u0019t. The matrix of two point kernels makes the model more complicated to estimate\n(see (Taranto et al., 2018)) while clearly HDIM reduces to TIM when \u0014\u0019s;\u0019t(t\u0000s) is a function only\nof the triggering event \u0019s.\nThe approach taking as exogenous the order \row includes also other models connecting the\norder \row in a given time interval with the simultaneous price change. A paradigmatic example\nis given by (Cont et al., 2014) which introduces a stylized model of the order book predicting a\ncontemporaneous linear relation between the price change in a given time interval and a linear\ncombination of level I order \row components (the Order Flow Imbalance or OFI). The goodness\nof the model (for large tick stocks) is testi\fed by the high R2empirically obtained in the linear\nregression between \u0001 ptand OFI.\n2) The above approach, however, leaves the order \row as completely exogenous. The limits of\nthis approach are evident for example when considering the negative lag response, i.e. the lagged\ncross correlation between past price returns and future order \row, i.e.\nR(\u001c) =E[f(vt)(pt+\u001c\u0000pt)] (6)\nwith\u001c < 0. When the simple TIM model with only one propagator for trades is calibrated\nusingR(\u001c) (or other equivalent methods) with \u001c >0, it is observed that the predicted negative lag\nresponse is smaller than the empirical one, indicating, as intuitive, that a declining (increasing) price\nattracts in the future more buy (sell) trades (Taranto et al., 2018). To overcome this problem, one\njointly models the dynamics of price and order \row. The seminal work in this context is (Hasbrouck,\n1991) who proposed a discrete time structural VAR model for the vector xt= (\u0001pt;f(vt))0,vtbeing\nthe volume of the market order at time t, of the form\nA0xt=pX\ni=1Aixt\u0000i+\u0018t (7)\nandA0=\u00121g\n0 1\u0013\nandAiare other 2\u00022 matrices to be estimated. The parameter gdescribes\nthe immediate impact of a trade on price.\nThis model has been generalized in several directions. First, instead of considering only market\norders and a single reference price (Hasbrouck used the midprice), (Hautsch and Huang, 2012)\nconsiders a vector containing bid and ask prices, the queue volume at the \frst three quotes on\neither sides of the LOB, and two dummy variables indicating the occurrence of buy and sell trades.\n7\n\nThey modeled this ten dimensional vector ytwith the Vector Error Correction Model\n\u0001yt=\u0016+\u000b\f0yt\u00001+pX\ni=1\u0000i\u0001yt\u0000i+\u0018t (8)\nwhere\u0016is a constant vector, \u000band\fdenote the loading and cointegrating matrices and \u0000 iare\nparameter matrices. Using impulse response function, they measured impact, separately on bid\nand ask prices, of the arrival of a limit order on a queue (for an approach based on TIM, see (Eisler\net al., 2012)), as well of course the impact of the arrival of a market order.\nThe second generalization considered instead continuous time models. For example, (Bacry\nand Muzy, 2014) introduces an Hawkes process for the four dimensional counting process Pt=\n(T+\nt;T+\nt;N+\nt;N\u0000\nt)0, where the \frst two components describe the arrival of buy and sell market\norders and the last two the upward/downward movements of the reference price. The model for\nthe intensity \u0015treads\n\u0015t=\u0016+Zt\n\u00001\b(t\u0000s)dPs (9)\nwhere\u0016is a constant baseline intensity, \b( t\u0000s) is a 4\u00024 matrix of kernels describing the lead-lag\ne\u000bects. Some care must be taken to model the immediate impact (the gterm in the Hasbrouck\nmodel above) by introducing a Dirac delta component in some elements of \b( t\u0000s). While this\nmodel can be directly put in connection with the Hasbrouck's VAR, its generalizations can easily\ninclude other components of the order \row, such as limit orders and cancellations, or even to take\ninto account order volume (see, for example, (Rambaldi et al., 2017) discussed below). Moreover\nthe continuous time approach allows to consider in the modeling the time between events, which\nare clearly neglected in discrete time approach \u0013 a la Hasbrouck.\nUnderstanding the relation between order \row and price is important for many reasons, such\nas to create realistic LOB simulators, to study the stability of markets under di\u000berent rules, etc.\nHowever, it is often very relevant to study how price reacts to a speci\fc sequence of orders generated\nby a speci\fc trading decision, i.e. what we called a metaorder, because this is related to transaction\ncost (mainly due to market impact) and to the release of private information into the prices. It is\nevident that, since we are neglecting a very large fraction of orders, those due to all other traders,\nthe relation between price dynamics and order \row of a single metaorder will become very noisy and\nlarge samples are required to obtain clean measures. Section 6 presents some empirical evidences\non the market impact of metaorders and the price dynamics during their execution.\n4 Order \row\nOrder \row is the process describing the arrival of orders in the market. If this works with a LOB,\nthen the order \row is the multivariate point process describing the arrival of market orders, limit\norders, and cancellations. Since limit orders (and cancellations) are also characterized by a limit\n8\n\nprice, a component of the multivariate process should be associated with each limit price, making\nimmediately the problem high-dimensional.\nDi\u000berent point process models of order \row have been proposed, ranging from (compound)\nPoisson processes (Daniels et al., 2003) to self exciting Hawkes processes (Abergel and Jedidi, 2015;\nRambaldi et al., 2017). Here we \frst review some of the empirical evidences and stylized facts\nobserved in order \row which make challenging the development of a realistic model of the LOB.\nThe \frst empirical evidence (even chronologically) is the so called diagonal e\u000bect (Biais et al.,\n1995) i.e. orders of a speci\fc type are more likely to be observed just after orders of the same type.\nInterestingly, (Rambaldi et al., 2017) extends this analysis by using a Hawkes process approach\nand shows that, by including volume into the analysis, the diagonal e\u000bect is markedly stronger for\nsame-type same-size orders (see below).\nThe diagonal e\u000bect is the manifestation of a more signi\fcant regularity observed in real LOBs:\ncomponents of the order \row are extremely persistent, i.e. long range autocorrelated in time.\nTo present a speci\fc example, consider only market orders, where volume is neglected and time\nis discretized in such a way that it increases by one unit each time a new market order arrives.\nDenoting with \u000ftthe sign of the t-th market order, being equal to +1 ( \u00001) for a buy (sell) order, it\nhas been empirically shown (Lillo and Farmer, 2004; Bouchaud et al., 2004) that its autocorrelation\nfunction behaves asymptotically as C(\u001c)\u0011Cor[\u000ft;\u000ft+\u001c]\u0018\u001c\u0000\rwith\r2[0;1]. The empirical value\nof\r'0:5 shows that the market order sign is a long memory process, i.e. it lacks a typical time\nscale, with Hurst exponent H= 1\u0000\r=2'0:75. A similar behavior has been observed for the\nother components of the order \row.\nSeveral explanations have been proposed for this stylized fact, empirically observed in many\ndi\u000berent markets, asset classes, and time periods. The theories can be clustered in two classes: the\n\frst states that this is the e\u000bect of herding , i.e. several investors share the same view on the asset\naround the same time and trade accordingly. The second explanation is instead related to the fact\nthat each trader creates an autocorrelated order \row and this is due to the practice of order splitting .\nDespite the fact that it is possible to create agent based models with either of the two mechanisms\nreproducing a correlated order \row, the assessment of the mechanism mainly responsible for this\nobservation should be based on empirical evidences. (Toth et al., 2015) proposes a method to\ndisentangle the herding and splitting contributions to the autocorrelation. The idea to use labeled\ndata, i.e. data where the identity of the trader sending the order is known (even if anonymized).\nThe autocorrelation function of order \row can be exactly decomposed as C(\u001c) =Csplit(\u001c)+Cherd(\u001c)\nwhere the \frst (second) term is the contribution to the correlation considering only cases when the\ntwo market orders at time tandt+\u001cwere placed by the same (di\u000berent) trader(s). To measure\nthe relative importance of the two components, (Toth et al., 2015) uses brokerage data. Some\nexchanges provide data where each order contains the coded identity of the broker who sent the\norder. An extensive investigation of LSE data shows unambiguously that Csplit(\u001c) explains always\nmore than 75% of C(\u001c) and, except for very short \u001c(one or two trades) the value is above 85%.\nThis empirical \fnding strongly indicates that order splitting is the main driver of the correlated\norder \row. Similar results are obtained when using data with agents rather than brokers.\nMarket orders describe only part of the order \row dynamics. Among the several approaches\n9\n\nto describe the full correlation structure of order \row (and price) we mention here the one using\nHawkes processes. Generalizing a pioneering paper (Large, 2007), (Bacry et al., 2016) models\nlevel-I order book data by using 8-dimensional Hawkes process whose components are market,\nlimit, cancel order (buy and sell), and mid-price changes (up and down). Using a non-parametric\nestimation method, their main \fnding is that the dominating driver of the process is self-excitation\n(i.e., once more, the diagonal e\u000bect). The only exceptions are the mid-price components for which\ncross-excitation e\u000bects are strongly dominating. Moreover there is a signi\fcant mean reversion of\nprice, since present price changes trigger price changes in the opposite direction. Interestingly most\nof the estimated diagonal kernels of the Hawkes process are slowly decreasing and well described\nby a power-law behavior, consistent with the long memory described above.\nThis type of approach can be generalized in several directions. For example, (Muni Toke, 2010)\nconsiders a full order book modeling using Hawkes process to disentangle the role and interaction\nbetween liquidity takers and providers. Another generalization considers the fact that orders are\nalso characterized by a volume. Mathematically one can treat volumes as marks of the multivariate\npoint process. Alternatively, when only few levels are considered in the analysis, one can bin the\nvolume inDgroups and consider the volume process as the superposition of Dunmarked point\nprocesses, each of which corresponds to one of the possible Dvalues that volume can take (Rambaldi\net al., 2017). It is found that order size does matter, since kernels for di\u000berent volume bins are\nquite di\u000berent. Moreover large orders trigger cascade of small orders and small limit orders and\ncancellations strongly cross-excite, indicating hectic order re-positioning by market makers.\nDespite the fact one can decide to model the (marked) multivariate process autonomously,\nobtaining as a consequence' of the persistence of the queue size, but, conditionally on\nthem, the arrival of orders follows a Poisson process. A natural extension of this model considers\nthe order arrival intensity as a function both of the LOB state and of the past order \row. By\nusing an Hawkes model with a kernel depending on both these variables, the State Dependent or\nQueue Reactive Hawkes models (Morariu-Patrichi and Pakkanen, 2018; Wu et al., 2019) have been\nproposed.\n5 Cross impact\nUp to now we have considered the market impact of trades and orders from a single asset. However,\ninstitutional investors rebalancing their portfolio very often trade simultaneously many assets.\nBoth the optimal execution problem and the assessment of transaction costs of metaorders should\n10\n\ntherefore take into account possible interactions between assets.\nGenerically, there are three sources of interaction: (i) statistical dependence in asset prices, i.e.\nthe well-known fact that returns of di\u000berent assets are correlated; (ii) commonality in liquidity\nacross assets (Chordia et al., 2000), i.e. the fact that, for example, the arrival rate of signed market\n(or limit) orders is correlated across assets, and (iii) quote revision e\u000bects, i.e. a trade in an asset\ncan lead market makers to modify the bid and ask price in another related asset. The (lagged)\ncorrelation between price and order \row is termed cross-impact . As in the single asset case, the\nentire order \row completely determines the (reference) prices of the assets, thus one can trivially\nexplain cross-impact (as well as self-impact) as a mere consequence of order \row dynamics and\ncorrelations. However, when conditioning to a subset of the order \row (for example a market order\nor the child orders of a metaorder), or when the future price evolution is of interest, the dynamics\nbecomes stochastic, because of the unmodeled part of the order \row and suitably modeling cross-\nimpact becomes critical for predictions or ex-ante cost estimation. Under this conditioning, cross-\nimpact can be dissected as the result of the three sources described above (Benzaquen et al., 2017).\nCross-impact has been empirically studied recently, see e.g. (Benzaquen et al., 2017; Schneider\nand Lillo, 2019) and its role in optimal execution has been highlighted in (Mastromatteo et al.,\n2017; Tsoukalas et al., 2019). We review here some results obtained when considering the market\norder \row. First, there is a measurable cross asset e\u000bect between order \row and price as can be\nmeasured by the cross response function, which generalizes Eq. 6 as\nRij(\u001c) =E[f(vi\nt)(pj\nt+\u001c\u0000pj\nt)] (10)\nbetween an order on asset iat timetand the price change of asset jin [t;t+\u001c].Rij(\u001c) is found to\nbe di\u000berent from zero and smaller than Rii(\u001c) by a factor\u00185 (Benzaquen et al., 2017; Schneider\nand Lillo, 2019). To investigate the source of this lagged correlation (Schneider and Lillo, 2019),\nby investigating empirically the high frequency dynamics of Italian sovereign bonds traded in an\ndouble auction market, \fnd evidence that both lagged correlations of orders across assets and quote\nrevisions play a role in forming cross-impact. This result is obtaned by investigating the e\u000bect on\nprice of bonds of isolated trades, i.e. trades on a bond such that no other trade is observed in other\nbonds a time window around it. This results indicates that both commonality in liquidity taking\nand price revision across assets are responsible for cross impact e\u000bects.\nThe TIM can be easily extended to the multi asset case. Considering the continuous time\nversion of the TIM, the price of asset iat timetis\npi\nt=pi\n0+X\njZt\n0fij( _xj\ns)Gij(t\u0000s)ds+Zt\n0\u001bi\nsdWi\ns (11)\nwherefij( _xj\ns) is the (instantaneous) impact on the price of asset iof trading asset jat a rate _xj\ns,\nGij(\u0001) is the decay kernel describing the lagged e\u000bect of trading on price, \u001bi\nsis the volatility of asset\niandWi\nsis a Wiener process. This model can be estimated on real data and it is found that: (i)\nfijis non-linear and well described by a power law function with an exponent smaller than 1 as\n11\n\nforfii; (ii) the kernels Gijalso display a power law behavior similar to Gii, but with a signi\fcantly\nsmaller amplitude; (iii) the matrix fGijgi;j=1;Nhas a strong sectorial structure, similar to the one\nobserved for returns (Benzaquen et al., 2017; Schneider and Lillo, 2019). These regularities and\nthe modeling can be successfully used to design optimal portfolio executions (Mastromatteo et al.,\n2017).\nAnother important question is whether a model like (11) is always well posed or if there are\ntrading strategies \u0005 = fxtgt2[0:T]allowing for price manipulation. More precisely, we remind\nthat a round-trip trade is a sequence of trades whose sum is zero, i.e. a trading strategy \u0005 withRT\n0_xtdt=0. Aprice manipulation is a round-trip trade \u0005 whose expected cost C(\u0005) is negative\nand the principle of no-dynamic-arbitrage states that such a price manipulation is impossible. For\nthe multi asset TIM this implies that\nC(\u0005) =X\ni;jZT\n0_xi\ntdtZt\n0fij( _xj\ns)Gij(t\u0000s)ds\u00150 (12)\n(Schneider and Lillo, 2019) proves a series of theorems constraining the form of fandGin order\nto avoid price manipulation. In particular authors showed that for bounded decay kernels instan-\ntaneous cross-impact fmust be an odd and linear function of trading intensity and cross-impact\nfrom asset ito assetjmust be equal to the one from jtoi. When a non vanishing bid-ask\nspread is considered, some inequalities between spread, maximum trading speed, and cross-impact\nasymmetry must be veri\fed to avoid price manipulation.\n6 Market impact of metaorders\nWhile the above described models generically describe the relation between order \row and price,\nit is often of practical and academic interest to study the price dynamics when conditioning this\nrelation to the execution of a (large) order by a speci\fc trader following a single trading decision\n(a metaorder). The seminal paper of (Kyle, 1985) shows that for a trader with insider information\nit is optimal to split the volume to be executed in many transactions to be executed incrementally\nover an extended period of time.\nA part from the practical problem of minimizing transaction costs, the relation between metaorder\nexecution and price dynamics is relevant to understand how information is incorporated into price.\nIn fact, a metaorder by de\fnition corresponds to a trading decision, which in general is the response\nof the trader to a piece of information. For this reason, it is important to understand, not only how\nthe price changes during the execution of the metaorder, but also the long term level reached by the\nprice when the transient e\u000bects due to the imbalance between supply and demand are dissipated.\nNote again the di\u000berence between the relation between order \row and price dynamics when one\nconsiders all market participants or only the order \row generated by the trading decision of a single\ntrader. As said above, price dynamics is a deterministic function of the order \row, while, when\nconditioning on the order \row of a speci\fc trader, we expect a very noisy relation between signed\n12\n\nvolume and price change. However the objective here is not to have an high R2between them, but\nto answer the question: how much my trading activity consequent to a trading decision is going to\na\u000bect on average the price?\nMeasuring market impact of metaorders is typically quite complicated because it requires suit-\nable data that cannot be inferred from public (e.g. market) data. In fact, it is necessary to have\naccess to data where one can track the activity of a single trader (broker or investor) following a\ngiven trading decision. For this reason, most of the empirical researches on this topic has been\nperformed by using trading data from a given institution or trading desk (Torre and Ferrari, 1998;\nAlmgren et al., 2005; Toth et al., 2011). A part from the di\u000eculty of accessing such data, this type\nof analyses runs the risk of being biased, since the sample is limited to a speci\fc fund, which might\nhave an idiosyncratic trading style. Market wide investigations of market impact of metaorders\nhave been conducted by following two approaches. First, some exchanges exceptionally provide\ndata where the coded identity of the market member is disclosed; thus by using suitable statistical\nmethods, one can infer metaorders as sequences of trades/orders by the same member on the same\nasset with the same sign (see for example, (Moro et al., 2009; Vaglica et al., 2010; T\u0013 oth et al.,\n2010)). The other approach requires the access to databases collected by specialized institutions\nand containing information about the metaorder executions of a large set of investors. The most\nimportant example is probably the dataset provided by ANcerno Ltd, a transaction cost analysis\n\frm for institutional investors. According to some estimates, it accounts for more than 10% of\nCRSP volume in US markets, thus providing a wide coverage of metaorder trading activity from\nmany di\u000berent institutional investors.\nMethodologically there are two main problems in measuring market impact of metaorders. First,\nimpact might depend on several conditioning variables, such as the market conditions at the time\nof the trade, the execution algorithm, etc., thus di\u000berent conclusions might be drawn depending on\nthe choice made. Second, market impact of metaorders is typically very noisy (see above), and, as\na consequence, large datasets are required to obtain small error bars on the estimated impact. It\nis important to stress that market impact contributes as a drift term to the unperturbed dynamics\nof price. For this reason, in order to measure market impact it is fundamental to take into account\nthe sign of the trade of the metaorder.\nThe main quantity of interest is the metaorder impact de\fned as\nI(Q;T)\u0011E[\u000f\u0001 logpjQ;T] (13)\nwhere \u0001 log pis the logprice change between the end and the start of the metaorder, Qis the\nsize of the metaorder (in shares), Tis the metaorder duration (in seconds or in volume time, to\nminimize possible intraday e\u000bects), and \u000fis the sign of the metaorder (i.e \u000f= +1 for a buy and\n\u000f=\u00001 for a sell order). Notice that I(Q;T) is directly related to the average impact cost of\na metaorder execution. In fact, for an execution described by \u0005 = fxtgt2[0;T], wherextis the\nasset position at time t, the expected implementation shortfall cost, i.e. the di\u000berence between the\nexpected cost and the theoretical cost obtained by marking to market the trade with the initial\nprice, isC(\u0005) =RT\n0_xtI(xt;t)dt, where _xtis the time derivative of xt(i.e. the trading speed).\n13\n\nMarket impact is better described in terms of normalized quantities which also allows to consider\ndi\u000berent assets and di\u000berent time periods in the same analysis. The \frst key quantity is the daily\n(or volume) fraction, de\fned as \u001e=Q=V , whereVis the average daily traded volume4. The\nsecond quantity is the participation rate \u0011, i.e the ratio between Qand the volume traded in the\nmarket during the execution. The third one is the metaorder duration T, which can be obtained\nfromT=\u001e=\u0011.\nRemarkably, many empirical studies (Torre and Ferrari, 1998; Moro et al., 2009; Zarinelli et al.,\n2015; Toth et al., 2011; Bershova and Rakhlin, 2013; Waelbroeck and Gomes, 2015) seem to agree\non the validity of the law'. For example,\nthe prefactor Ymight depend on the trading algorithm.\nMore recent and extensive empirical analyses (Zarinelli et al., 2015) clarify the limits of the\nsquare-root impact law and highlight some deviations. Speci\fcally:\n•Considering a power law dependence on Tand\u0011, (Zarinelli et al., 2015) investigates the\nregression\nI(Q;T) =A T\u000eT\u0011\u000e\u0011\u0001noise (15)\nto measure the dependence of metaorder impact separately on participation rate and duration.\nThe \ftted exponents are \u000eT= 0:54\u00060:01 and\u000e\u0011= 0:52\u00060:01, andA= 0:207\u00060:005. The\nfact that both exponents are very close to 1 =2 indicates thatI(Q;T)\u0019p\u001e, at least as a \frst\napproximation, even when considering the e\u000bect of participation rate and duration.\n•By consideringI(Q;T) as a function only of \u001e=Q=V , it is clear that a logarithmic function\n\fts the data better than a power law function; this indicates a linear behavior of impact for\nsmall volumes and an extra concavity (likely due to a selection bias) for very large volumes.\nBelow we will present two possible explanations for the linear behavior of the impact for small\n\u001e.\n•By consideringI(Q;T) as a function of both variables, (Zarinelli et al., 2015) introduces the\nmarket impact surface and showed that a double logarithmic function outperforms the power\nlaw form of Eq. 15.\n4Vand\u001b(see below) are typically estimated over the past 10 \u000425 trading days, excluding the day when the\nmetaorder is executed.\n14\n\nInterestingly, Eq. 15 can be predicted from the execution of a metaorder with constant par-\nticipation rate in the continuous time TIM model with f(v) = sgn(v)jvj\u000eandG(t) =t\u0000\rwith\n\u000eT= 1\u0000\rand\u000e\u0011=\u000e, thus\u000e=\r= 1=2 (Gatheral, 2010).\nNotice that the square root impact law is not related to the fact that volatility scales as the\nsquare root of (execution) time, which, for a \fxed participation rate, is proportional to metaorder\nsize. First, according to de\fnition 13, market impact is a drift term and the inclusion of the\nmetaorder sign \u000fis critical in the de\fnition, while neglecting \u000fsimply highlights the relation between\nvolatility and volume. Second, the result of the regression of Eq. 15 indicates that, by controlling\nfor bothTand\u0011, market impact is mainly dependent onpT\u0011=p\u001e. Third, as shown explicitly in\n(Bucci et al., 2019b), market impact curves of metaorders with \u001e&5\u000110\u00004(roughly 80% of those\nin the ANcerno database) are independent on Tand consistent with a square root dependence on\n\u001e. Once more, impact of the remaining small metaorders are better described by a linear relation.\n(Bucci et al., 2019b) also shows that the variance of impact depends linearly on T, as expected\nby the di\u000busivity of price, and this price uncertainty largely exceeds the average reaction impact\ncontribution (which in turn explains why the R2in the market impact estimation is typically very\nsmall).\nFrom a modeling perspective, the square root impact law and its deviations are well described\nby the Locally Linear Order Book (LLOB) model for the coarse-grained dynamics of latent liquidity\n(Donier et al., 2015). In a nutshell, LLOB is a limit order book model whose quantity of interest is\nthe density '(x;t) of latent orders around price xat timet. Conventionally, one can choose 'to be\npositive for buy latent5orders (corresponding to x<p (t), wherep(t) is here the current transaction\nprice) and negative for sell latent orders (corresponding to x>p (t)). The coarse-grained dynamics\nof the latent liquidity is well described by\n@t'=D@xx'\u0000\u0017'+\u0015sgn(y) +m \u000e(y); (16)\nwherey\u0011p(t)\u0000x, and\u0017describes order cancellation, \u0015new order deposition and D@xxlimit\nprice reassessments. The \fnal \\source\" term corresponds to a metaorder of size Qexecuted at\na constant rate m=Q=T, corresponding to a \rux of orders localized at the transaction price\np(t). In the absence of a metaorder ( m= 0), Eq. (16) admits a stationary solution in the price\nreference frame, which is linear when yis small, i.e. 'st(y) =LywhereL=\u0015=p\nD\u0017is a measure\nof liquidity. The total transaction rate Jis simply given by the \rux of orders through the origin,\ni.e.J\u0011D@y'stjy=0=DL.\nIn the limit of a slow latent order book (i.e. \u0017T\u001c1), the price trajectory pm(t) during the\nexecution of the metaorder (obtained as the solution of '(pm;t) = 0) is given by the self-consistent\n5The LLOB model has been originally developed for describing the latent liquidity, not necessarily the visible\none. However close to the spread the two liquidities should coincide.\n15\n\nexpression (Donier et al., 2015)\npm(t) =p0(t) +y(t); (17)\ny(t) =m\nLZt\n0dsp\n4\u0019D(t\u0000s)exp\u0014\n\u0000(y(t)\u0000y(s))2\n4D(t\u0000s)\u0015\n; (18)\nwherep0(t) is the price trajectory in the absence of the metaorder that starts at t= 0 and ends\natt=T. Interestingly, when impact is small, i.e. if 8t;sit isjy(t)\u0000y(s)j\u001cD(t\u0000s), the above\nexpression for the price dynamics coincides with the TIM with \u000e= 1 and\r= 1=2.\nPrice impact of a metaorder in the LLOB model is then de\fned as I(Q;T) =y(T), and is found\nto be given by\nI(Q;T) =r\nDQ\nJF(\u0011);with\u0011\u0011Q\nJT; (19)\nwhere\u0011is the participation rate and the scaling function F(\u0011)\u0019p\n\u0011=\u0019for\u0011\u001c1 and\u0019p\n2 for\n\u0011\u001d1. Hence,I(Q;T) is linear in Qfor smallQat \fxedT, and crosses over to a square-root\nfor largeQ. Note that in the square-root regime, impact is predicted to be independent of the\nexecution time T, as approximately observed empirically (see the discussion above).\nThe theoretical predictions of LLOB model have been empirically tested in (Bucci et al., 2019a)\nwhere, using a large dataset of more than 8 million metaorders from the ANcerno database, it\nhas been shown a remarkable qualitative agreement between the data and the model. However\nthe original model in (Donier et al., 2015) predicts the crossover of impact from the linear to the\nsquare root regime at \u0011\u0003= 1, while empirical data shows that this value is much closer to 10\u00003.\n(Benzaquen and Bouchaud, 2018) generalizes the model of (Donier et al., 2015) by introducing (at\nleast) two types of liquidity providers, acting on two di\u000berent time scales: slow and persistent agents\nare able to resist the impact of the metaorder and fast agents who lubricate the high-frequency\nactivity of markets. The introduction of two types of agents modi\fes the value of the crossover\nparticipation rate \u0011\u0003. (Bucci et al., 2019a) shows that the LLOB model with two types of agents\n\fts quantitatively extremely well the shape of I(Q;T) as a function of \u001eand\u0011when tested on the\nANcerno database.\nBeside the total impact of a metaorder, it is interesting to investigate the properties of the\naverage price dynamics during and after the execution of a metaorder, because this analysis gives\ninsightful information on the price impact dynamics and the role of information in trading. The\n\frst problem has been investigated in (Zarinelli et al., 2015) by computing the average price path\nduring metaorders' execution by considering subsets of metaorders with di\u000berent duration Tand\nparticipation rate \u0011. Again, large samples are required due to the high level of noise in this type\nof data and ANcerno dataset allows to perform robust statistical analyses. One of the investigated\nquestion is whether, given two metaorders with the same participation rate \u0011and di\u000berent durations\nT1andT2(T1< T 2), the market impact reached at time T1is the same for the two metaorders.\nThe empirical answer is clearly negative: The market impact trajectories deviate from the market\nimpact surface. For small participation rates, this e\u000bect is stronger and price trajectories are\n16\n\nwell above the immediate impact. Moreover, in most cases the price reverts before the end of the\nmetaorder (see also (Bacry et al., 2015)), while for larger \u0011, the price trajectories become closer and\ncloser to the values of the impact surface. The observation of non-overlapping trajectories might\nbe explained in terms of executions with variable participation rate. A front-loaded execution,\ni.e., an execution with a decreasing participation rate, produces a strong impact at the beginning\nand a milder impact toward the end, as observed in real data. This choice might be due to risk\naversion (Almgren and Chriss, 2001) or to the attempt to catch as much liquidity on the book as\npossible. It is quite interesting to observe that the TIM model with a front-loaded execution is able\nto reproduce the observed fact that price impact trajectories revert during the execution of the\nmetaorder. On the contrary, a model with permanent impact, such as the Almgren-Chriss model,\n(Almgren and Chriss, 2001) always gives monotonic price trajectories if the sign of the trades is\nuniform.\nThe behavior of price after the end of the metaorder is more complicated to estimate, in part\nbecause the noise level is even larger than during the metaorder execution. The observed average\nprice dynamics is consistent with a reversion of the price with respect to the value reached at the\nend of the execution. This is another con\frmation of the transient nature of market impact as\ndescribed, for example, by the TIM. The long term value of the price is even more complicated\nto estimate for several reasons. First, the very slow decay of impact requires to measure impact\non a long time horizon, when volatility e\u000bects become dominant. Second, end of day e\u000bect and\novernight returns could make di\u000ecult to estimate permanent impact if the decay continues the days\nafter the metaorder execution. Third, metaorders are sometimes split over multiple days creating\nan autocorrelation of metaorders, which makes hard to estimate the fair pricing' theory of (Farmer et al., 2013) an equilib-\nrium condition is derived between liquidity providers and a broker aggregating informed metaorders\nfrom several funds. The theory predicts that the average price payed during the execution is equal\nto the price at the end of the reversion phase. If metaorder size distribution is power law with\ntail exponent 3 =2 (as empirically observed), the impact is predicted to decay towards a plateau\nvalue whose height is 2 =3 of the peak impact, i.e. the impact reached exactly when the metaorder\nexecution is completed.\nInterestingly, several empirical studies reports results compatible with the 2 =3 factor (Moro\net al., 2009; Zarinelli et al., 2015; Bershova and Rakhlin, 2013; Waelbroeck and Gomes, 2015)\nalthough the latter paper notes that the impact of uninformed trades appears to relax to zero. On\nthe other hand, (Brokmann et al., 2015) underlines the importance of metaorders split over many\nsuccessive days, as this may strongly bias upwards the apparent plateau value. After accounting\nfor metaorder autocorrelations (from a single fund), the paper concludes that impact decays as a\npower-law over several days, with no clear asymptotic value. A more extensive analysis has been\nperformed using the ANcerno database in (Bucci et al., 2018) which shows that while at the end of\nthe same day the average price is on average close to 2 =3 of the peak impact, the decay continues\nthe next days, following a power-law function at short time scales, and apparently converges to a\nnon-zero asymptotic value at long time scales (roughly 50 days) close to 1 =3 of the peak impact.\nFor such long time lags, however, market noise becomes dominant and makes it di\u000ecult to conclude\n17\n\non the asymptotic value of impact, which is a proxy for the (long time) information content of the\ntrades.\n7 Co-impact\nIn the previous section, market impact of a metaorder is de\fned by conditioning only on its prop-\nerties (size and duration). However, in a given day there is typically a large number of funds\nsimultaneously trading the same stock. As empirically observed in (Zarinelli et al., 2015) by inves-\ntigating the ANcerno database, there is a clear tendency of traders to send metaorders with the\nsame sign (buy or sell) on the same asset. The reason for this coherent behavior are manyfold, but\nprobably the most important one is related to the similarity of trading strategies among institu-\ntional investors. One can thus ask how the presence of other metaorders, modi\fes market impact\nand the associated transaction cost of a given metaorder. This crowding e\u000bect on market impact\nhas been termed co-impact (Bucci et al., 2020). We are thus changing the conditioning variables in\nthe de\fnition of market impact by considering a vector of simultaneously present metaorders. We\nwill then averaging this quantity by using their joint distribution, keeping as conditioning variable\nthe metaorder whose impact we are interested in.\n(Bucci et al., 2020) investigates how the expected open to close daily logreturn \u0001 p(d)\u0011logpclose=popen\ndepends on the order \row generated by the ANcerno metaorders. Consider a day when Nmetaorders\nare simultaneously present, each described by ~\u001ei\u0011\u000fiQi=V, (i= 1;:::;N ), whereVis again the\naverage daily volume and \u000fiandQiare, respectively, the sign and the size of the i-th metaorder.\nDe\fning the vector ~'N= (~\u001e1;::;~\u001eN), the quantity of interest is\nI(~'N)\u0011E[\u0001p(d)j~'N] (20)\nThis is however a function of Nvariables and some parametric restriction must be made to estimate\nit from data. (Bucci et al., 2020) empirically \fnds that the above quantity is well described by\nI(~'N) =Y\u0001f\u000e(\b), where ~\b =PN\ni=1~\u001eiandf\u000e(v) = sgn(v)jvj\u000ewith\u000e'1=2. Thus the average\nprice mainly reacts with a square root law to the total net order \row of ongoing metaorders. This\nmeans that the market, due also to the fact that trading is anonymous, is unable to individually\ndistinguish them. Despite the insensitivity of the price to individual metaorders is quite intuitive,\nit also raises some issues on how the square root impact can hold. Let consider a simple example\nwhere there is a buy metaorder with order \row ~\u001e>0, which is traded simultaneously with other\nmetaorders with total order \row ~\u001em>0. Assuming that the square root law applies for the total\norder \row, the observed impact is\nE[\u0001p(d)j~\u001e;~\u001em]/q\n~\u001e+~\u001em (21)\nKeeping ~\u001em\fxed, when ~\u001e!0 market impact tends to a constant, for ~\u001e\u001c~\u001em, instead, E[\u0001pj~\u001e;~\u001em]\nis linear in ~\u001e, and only when ~\u001e\u001d~\u001ema square root behavior is expected. Thus, how can a non-linear\nimpact law survive in the presence of a large number of simultaneously executed metaorders?\n18\n\nThe argument can be made mathematically more precise by asking what is the expected impact\nof a metaorder, labeled with k, when other N\u00001 are simultaneously being executed. Given the\nevidence above, this impact can be written as6\nIN(~\u001e)\u0011E[\u0001p(d)j~\u001ek=~\u001e;N] =YZ\nd~\u001e1:::d~\u001eNP(~'Nj~\u001ek=~\u001e)f\u000e(~\u001ek+X\ni6=k~\u001ei) (22)\nOne can then obtain the unconditional impact by averaging IN(~\u001e) over the distribution P(N)\nof the number of metaorders per day. Thus IN(~\u001e) depends on the joint distribution of order\n\rowsP(~'N) and (Bucci et al., 2020) derives the analytical expression for IN(~\u001e) under di\u000berent\nspeci\fcation for it (for example multivariate Gaussian). A crossover from a linear to a square root\nbehavior is predicted and the transition point depends on the number of metaorders Nand on their\ncorrelation (more generally, statistical dependence). When Nis small, a small investor will observe\nlinear impact with a non-zero intercept I0, crossing over to a square-root law at larger ~\u001e. The\ninterceptI0grows with the correlation between the signs of the metaorders and can be interpreted\nas the average impact of all the other metaorders. When the number of metaorders is large and the\ninvestor has no correlation with their average sign, one should expect on a given day a square-root\nimpact randomly shifted upwards or downwards by I0. Averaged over all days, a pure square-root\nlaw emerges, which explains why such behavior has been reported in many empirical papers.\nCalibrating such model on real data requires to make some assumptions on the joint distribution\nP(~'N). (Bucci et al., 2020) shows that the correlation of absolute volume fractions \u001ei=j~\u001eij\nis negligible, while correlation between metaorder signs plays an important role. By calibrating\na simple heuristic model where a single factor drives the metaorder signs, (Bucci et al., 2020)\nreproduces to a good level of precision the di\u000berent regimes of the empirical market impact curves\nas a function of ~\u001e,N, and the correlation of their signs. In particular, for a metaorder uncorrelated\nwith the rest of the market, the impacts of other metaorders cancel out on average. Conversely,\nany intercept of the impact law can be interpreted as a non-zero correlation with the rest of the\nmarket.\nIt is interesting to make a comparison with what simple models of market impact predict on price\nimpact when many informed agents are simultaneously present. (Bagnoli et al., 2001) investigates\nthe equilibrium in a one-period Kyle model (Kyle, 1985). Nsymmetrically and informed agents\ntrade one asset in a market where uninformed agents and market makers are also present. Bagnoli\net al. (2001) shows that the Kyle's lambda, i.e. the proportionality factor between price impact\nand aggregated order \row, scales as N\u00001=\u000b, where\u000bis the exponent of the stable law describing\nthe price and uninformed order \row distribution. Moreover if the second moment of both variables\nis \fnite, Bagnoli et al. (2001) shows that the Kyle's lambda scales as 1 =p\nN. Interestingly, Figure 3\nof Bucci et al. (2020) shows that market impact of a ANcerno metaorder decreases with the number\nof metaorders simultaneously present.\n6Note that we are conditioning on the signed volume fraction ~\u001ek, which, under buy-sell symmetry, is equivalent\nto compute the expectation of \u000fk\u0001p(d)conditional to absolute volume fraction \u001e. In other words, also here we are\nmeasuring a drift term.\n19\n\nFrom a practical perspective, the model and the empirical observations are important for traders\nto estimate (pre- and post-execution) the cost of their trades, and thus to help them deciding when\nis the right moment to trade. For example, (Briere et al., 2020), investigating the ANcerno database,\n\fnds an approximately linear relation between the implementation shortfall of a metaorder and the\nnet trading imbalance due to the other metaorders simultaneously traded. When the trade is in\nthe same direction as the net order \row imbalance, one could expect to pay a signi\fcant trading\ncost up to 0 :4 points of price volatility, while one could expect to bene\ft from a price improvement\nof 0:3 points of volatility when the trader is almost alone in front of his competitors aggregate \row.\nIn a normal trading situation, the information on the ongoing metaorders is not available, thus\nstatistical and machine learning methods could be used to infer, at least partly, this information\nfrom the visible order \row.\n8 Conclusion\nAs it should be clear from this short review, in the last twenty years we have made huge progresses\nin understanding the important and fascinating problem of how price is formed in \fnancial markets\nas the result of order \row and trading activity. This advancement is due to the availability of very\ndetailed and rich datasets and to the development of sophisticated models able to capture, at least\npartly, the strong dependencies and feedbacks between orders and prices. Still much remains to do.\nFor example, most models are inherently stationary and with \fxed parameters, while liquidity, as\nmany market variables, are highly dynamic and latent. Methods from econometrics (\fltering, score\ndriven models) and machine learning (reinforcement learning) can provide the tools for tackling\nthis important aspect of market dynamics. Combining these models with optimal execution or\noptimal market making solutions available in real time would certainly provide a great addition for\nthe industry.\nReferences\nAbergel, F. and Jedidi, A. (2015). Long-time behavior of a hawkes process-based limit order book.\nSIAM Journal of Financial Mathematics , 6:1026{1043.\nAlmgren, R. and Chriss, N. (2001). Optimal execution of portfolio transactions. Journal of Risk ,\n3:5{40.\nAlmgren, R., Thum, C., Hauptmann, E., and Li, H. (2005). Direct estimation of equity market\nimpact. Risk, 18(7):5862.\nBacry, E., Iuga, A., Lasnier, M., and Lehalle, C.-A. (2015). Market impacts and the life cycle of\ninvestors orders. Market Microstructure and Liquidity , 1:1550009.\n20\n\nBacry, E., Jaisson, T., and Muzy, J. (2016). Estimation of slowly decreasing hawkes kernels:\napplication to high-frequency order book dynamics. Quantitative Finance , 16:1179{1201.\nBacry, E. and Muzy, J.-F. (2014). Hawkes model for price and trades high-frequency dynamics.\nQuantitative Finance , 14:1{20.\nBagnoli, M., Viswanathan, S., and Holden, C. (2001). On the existence of linear equilibria in\nmodels of market making. Mathematical Finance , 11(1):1{31.\nBenzaquen, M. and Bouchaud, J.-P. (2018). Market impact with multi-timescale liquidity. Quan-\ntitative Finance , 18:1781.\nBenzaquen, M., Mastromatteo, I., Eisler, Z., and Bouchaud, J.-P. (2017). Dissecting cross-impact\non stock markets: An empirical analysis. Journal of Statistical Mechanics , 2017:023406.\nBershova, N. and Rakhlin, D. (2013). The non-linear market impact of large trades: Evidence from\nbuy-side order \row. Quantitative Finance , 13(11):1759{1778.\nBiais, B., Hillion, P., and Spatt, C. (1995). An empirical analysis of the limit order book and order\n\row in the paris bourse. Journal of Finance , 50:11655{1689.\nBouchaud, J.-P., Farmer, J. D., and Lillo, F. (2009). How markets slowly digest changes in sup-\nply and demand. In Handbook of Financial Markets: Dynamics and Evolution , pages 57{160.\nElsevier.\nBouchaud, J.-P., Gefen, Y., Potters, M., and Wyart, M. (2004). Fluctuations and response in\n\fnancial markets: the subtle nature of 'random' price changes. Quantitative Finance , 4(2):176{\n190.\nBriere, M., Lehalle, C.-H., Nefedova, T., and Raboun, A. (2020). Modeling transaction costs when\ntrades may be crowded: A bayesian network using partially observable orders imbalance. Machine\nLearning for Asset Management: New Developments and Financial Applications , pages 387{430.\nBrokmann, X., Serie, E., Kockelkoren, J., and Bouchaud, J.-P. (2015). Slow decay of impact in\nequity markets. Market Microstructure and Liquidity , 1(02):1550007.\nBucci, F., Benzaquen, M., Lillo, F., and Bouchaud, J.-P. (2018). Slow decay of impact in equity\nmarkets: Insights from the ancerno database. Market Microstructure and Liquidity , 4(3):1950006.\nBucci, F., Benzaquen, M., Lillo, F., and Bouchaud, J.-P. (2019a). Crossover from linear to square-\nroot market impact. Physical Review Letters , 122(10):108302.\nBucci, F., Mastromatteo, I., Bouchaud, J.-P., and Benzaquen, M. (2019b). Impact is not just\nvolatility. Quantitative Finance , 19(11):1763{1766.\n21\n\nBucci, F., Mastromatteo, I., Eisler, Z., Lillo, F., Bouchaud, J.-P., and LeHalle, C.-A. (2020). Co-\nimpact: crowding e\u000bects in institutional trading activity. Quantitative Finance , 20(2):193{205.\nChordia, T., Roll, R., and Subrahmanyam, A. (2000). Commonality in liquidity. Journal of\nFinancial Economics , 56(1):3 { 28.\nCont, R., Kukanov, A., and Stoikov, S. (2014). The price impact of order book events. Journal of\nFinancial Econometrics , 12:47{88.\nCont, R., Stoikov, S., and Talreja, R. (2010). A stochastic model for order book dynamics. Opera-\ntions Research , 58(3):549{563.\nDaniels, M. G., Farmer, J. D., Gillemot, L., Iori, G., and Smith, E. (2003). Quantitative model of\nprice di\u000busion and market friction based on trading as a mechanistic random process. Physical\nReview Letters , 90(10):108102{4.\nDonier, J. and Bonart, J. (2015). A million metaorder analysis of market impact on the bitcoin.\nMarket Microstructructure and Liquidity , 1:1550008.\nDonier, J., Bonart, J., Mastromatteo, I., and Bouchaud, J.-P. (2015). A fully consistent, minimal\nmodel for non-linear market impact. Quantitative Finance , 15:1109.\nEisler, Z., Bouchaud, J.-P., and Kockelkoren, J. (2012). The price impact of order book events:\nMarket orders, limit orders and cancellations. Quantitative Finance , 12:1395{1419.\nFarmer, J., Gerig, A., Lillo, F., and Waelbroeck, H. (2013). How e\u000eciency shapes market impact.\nQuantitative Finance , 13:1743{1758.\nGatheral, J. (2010). No-dynamic-arbitrage and market impact. Quantitative Finance , 10(7):749{\n759.\nHasbrouck, J. (1991). Measuring the information content of a trade. The Journal of Finance ,\n46:179{207.\nHautsch, N. and Huang, R. (2012). Measuring the information content of a trade. Journal of\nEconomic Dynamics & Control , 36:501{522.\nHuang, W., Lehalle, C.-A., and Rosenbaum, M. (2015). Simulating and analyzing order book data:\nThe queue-reactive model. Journal of the American Statistical Association , 110:107{122.\nKyle, A. S. (1985). Continuous auctions and insider trading. Econometrica: Journal of the Econo-\nmetric Society , 53:1315{1335.\nLarge, J. (2007). Measuring the resiliency of an electronic limit order book. Journal of Financial\nMarkets , 10:1{25.\n22\n\nLillo, F. and Farmer, J. (2004). The long memory of the e\u000ecient market. Studies in nonlinear\ndynamics & econometrics , 8:3.\nLillo, F., Farmer, J. D., and Mantegna, R. N. (2003). Econophysics: Master curve for price-impact\nfunction. Nature , 421:129{130.\nMadhavan, A., Richardson, M., and Roomans, M. (1997). Why do security prices change? a\ntransaction-level analysis of nyse stocks. Review of Financial Studies , 10:1035{1064.\nMastromatteo, I., Benzaquen, M., Eisler, Z., and Bouchaud, J.-P. (2017). Trading lightly: Cross-\nimpact and optimal portfolio execution. Risk, 30:82{87.\nMorariu-Patrichi, M. and Pakkanen, M. (2018). State-dependent hawkes processes and their appli-\ncation to limit order book modelling. arxiv.org/pdf/1809.08060 .\nMoro, E., Vicente, J., Moyano, L. G., Gerig, A., Farmer, J. D., Vaglica, G., Lillo, F., and Mantegna,\nR. N. (2009). Market impact and trading pro\fle of hidden orders in stock markets. Physical\nReview E , 80(6):066102.\nMuni Toke, I. (2010). Market making in an order book model and its impact on the bid-ask spread.\nInEconophysics of Order-Driven Markets . Springer.\nRambaldi, M., Bacry, E., and Lillo, F. (2017). The role of volume in order book dynamics: a\nmultivariate hawkes process analysis. Quantitative Finance , 17(7):999{1020.\nSchneider, M. and Lillo, F. (2019). Cross-impact and no-dynamic-arbitrage. Quantitative Finance ,\n19(1):137{154.\nSirignano, J. (2019). Deep learning for limit order books. Quantitative Finance , 19(4):549{570.\nTaranto, D., Bormetti, G., Bouchaud, J.-P., Lillo, F., and Toth, B. (2018). Linear models for the im-\npact of order \row on prices i. propagators: Transient vs. history dependent impact. Quantitative\nFinance , 18:903{915.\nTorre, N. G. and Ferrari, M. J. (1998). The market impact model. Horizons, The Barra Newsletter ,\n165.\nToth, B., Eisler, Z., and Bouchaud, J.-P. (2016). The square-root impact law also holds for option\nmarkets. Wilmott , 85:70.\nToth, B., Lemperiere, Y., Deremble, C., De Lataillade, J., Kockelkoren, J., and Bouchaud, J.-P.\n(2011). Anomalous price impact and the critical nature of liquidity in \fnancial markets. Physical\nReview X , 1(2):021006.\n23\n\nT\u0013 oth, B., Lillo, F., and Farmer, J. (2010). Segmentation algorithm for non-stationary compound\npoisson processes. with an application to inventory time series of market members in a \fnancial\nmarket. European Physical Journal B , 78:235{243.\nToth, B., Palit, I., Lillo, F., and Farmer, J. (2015). Why is equity order \row so persistent? Journal\nof Economic Dynamics & Control , 51:218{239.\nTsoukalas, G., Wang, J., and Giesecke, K. (2019). Dynamic portfolio execution. Management\nScience , 65(5):2015{2040.\nVaglica, G., Lillo, F., and Mantegna, R. N. (2010). Statistical identi\fcation with hidden markov\nmodels of large order splitting strategies in an equity market. New Journal of Physics , 11:075031.\nWaelbroeck, H. and Gomes, C. (2015). Is market impact a measure of the information value of\ntrades? market response to liquidity vs. informed trades. Quantitative Finance , 15:773{793.\nWu, P., Rambaldi, M., Muzy, J.-F., and Bacry, E. (2019). Queue-reactive hawkes models for the\norder \row. arxiv.org/pdf/1901.08938 .\nZarinelli, E., Treccani, M., Farmer, J. D., and Lillo, F. (2015). Beyond the square root: Evidence for\nlogarithmic dependence of market impact on size and participation rate. Market Microstructure\nand Liquidity , 1(02):1550004.\n24", "files_in_pdf": []}